import subprocess


def rock_me(command, info):
    process = subprocess.Popen([command], stdout=subprocess.PIPE, shell=True, stderr=subprocess.PIPE, text=True)
    output, error = process.communicate()
    print(info)
    print(output)


print("Данные о хосте")
print("--------------------------------------------------")
rock_me("date", "Дата и время")
rock_me('hostname', 'Имя хоста:')
rock_me('ip a', 'IP-адреса:')
rock_me('uname -a', 'Версия ядра ОС:')
rock_me('cat /etc/passwd', 'Список пользователей:')
rock_me('uptime', 'Время работы:')
rock_me('last', 'Последний запуск:')
rock_me('who', 'Пользователи:')
rock_me('groups', 'Группы пользователей:')

rock_me("ls /root", "Директория рута")

print("Информация о директориях пользователей и рута.")
print("--------------------------------------------------")
rock_me("ls /home", "Домашние директории пользователей")
rock_me("ls /root", "Директория рута")
rock_me("tree /root", "Краткий вывод структур директорий")

print("Папки, куда данные программы могут писать полезную инфу, например хранить базы, пароли, историю и прочие"
      "сведения.")
print("--------------------------------------------------")
rock_me("cat /var\n/etc", "Папки для хранения данных программ")
rock_me("cat /etc/mysql\n/etc/apache2", "Примеры папок с настройками")
rock_me("cat ~/.mozilla/firefox", "Директории браузерных баз (Firefox)")
rock_me("cat ~/.config/google-chrome", "Директории браузерных баз (Chrome)")

print("Информация об обращении к сети TOR")
print("--------------------------------------------------")
rock_me("torsocks curl https://check.torproject.org", "Проверка доступности сети TOR")

print("Наличие wine и перечень ПО установленного там")
print("--------------------------------------------------")
rock_me("wine --version", "Версия Wine")

print("История консоли")
print("--------------------------------------------------")
rock_me("history", "История консоли")

print("Перечень процессов системы, в том числе в состоянии демона")
print("--------------------------------------------------")
rock_me("ps aux", "Список процессов")
rock_me("ps aux | grep 'D'", "Процессы в состоянии демона")

print("Перечень процессов системы, в том числе в состоянии демона")
print("--------------------------------------------------")
rock_me("ls -a ~", "Cкрытые файлы (в Linux начинаются с точки) в домашних каталогах пользователей")



