#!/bin/bash

echo "Данные о хосте"
echo "--------------------------------------------------"
echo -en '\nИмя хоста:\n'
hostname
echo -en '\nДата и время на хосте:\n'
date

echo -en '\nСетевые интерфейсы:\n'
ip a
echo -en '\nВерсия ядра ОС:\n'
uname -a

echo -en '\nСписок пользователей:\n'
awk -F: '{print $1}' /etc/passwd

echo -en '\nВремя работы:\n'
uptime
echo -en '\nПоследний запуск:\n'
last
echo -en '\nПользователь:\n'
who
echo -en '\nГруппы пользователей:\n'
groups

echo -en "\nИнформация о директориях пользователей и рута.\n"
echo "--------------------------------------------------"
ls -a /home
ls /root
tree /root

echo -en "\nПапки, куда данные программы могут писать полезную инфу, например хранить базы, пароли, историю и прочие"
echo -en "сведения.\n"
echo "--------------------------------------------------"
cat /var /etc
cat /etc/mysql /etc/apache2
cat ~/.mozilla/firefox
cat ~/.config/google-chrome

echo -en "\nИнформация об обращении к сети TOR\n"
echo "--------------------------------------------------"
torsocks curl https://check.torproject.org

echo -en "\nНаличие wine и перечень ПО установленного там\n"
echo "--------------------------------------------------"
wine --version

echo -en "\nИстория консоли\n"
echo "--------------------------------------------------"
history

echo -en "\nПеречень процессов системы, в том числе в состоянии демона\n"
echo "--------------------------------------------------"
ps aux
ps aux | grep 'D'

echo -en "\nCкрытые файлы (в Linux начинаются с точки) в домашних каталогах пользователей\n"
echo "--------------------------------------------------"
ls -a ~
