#!/bin/bash

echo "Данные о хосте"
echo "--------------------------------------------------"
date
echo 'Имя хоста:'
hostname
echo 'IP-адреса:'
ip a
echo 'Версия ядра ОС:'
uname -a
echo 'Список пользователей:'
cat /etc/passwd
echo 'Время работы:'
uptime
echo 'Последний запуск:'
last
echo 'Пользователи:'
who
echo 'Группы пользователей:'
groups

echo "Директория рута"
echo "--------------------------------------------------"
ls /root

echo "Информация о директориях пользователей и рута."
echo "--------------------------------------------------"
ls /home
ls /root
tree /root

echo "Папки, куда данные программы могут писать полезную инфу, например хранить базы, пароли, историю и прочие"
echo "сведения."
echo "--------------------------------------------------"
cat /var /etc
cat /etc/mysql /etc/apache2
cat ~/.mozilla/firefox
cat ~/.config/google-chrome

echo "Информация об обращении к сети TOR"
echo "--------------------------------------------------"
torsocks curl https://check.torproject.org

echo "Наличие wine и перечень ПО установленного там"
echo "--------------------------------------------------"
wine --version

echo "История консоли"
echo "--------------------------------------------------"
history

echo "Перечень процессов системы, в том числе в состоянии демона"
echo "--------------------------------------------------"
ps aux
ps aux | grep 'D'

echo "Cкрытые файлы (в Linux начинаются с точки) в домашних каталогах пользователей"
echo "--------------------------------------------------"
ls -a ~
